README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-09 Wed 02:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bestwhois - a command-line whois-like client for the WHOIS and WHOIS History APIs by WhoisXML API Inc.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="WhoisXML API, Inc." />
</head>
<body>
<div id="content">
<h1 class="title">bestwhois - a command-line whois-like client for the WHOIS and WHOIS History APIs by WhoisXML API Inc.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd460417">1. About</a></li>
<li><a href="#orgab23b20">2. Installation</a>
<ul>
<li><a href="#org3fdf284">2.1. Prerequisites</a></li>
<li><a href="#orgb32a639">2.2. Running the program</a></li>
</ul>
</li>
<li><a href="#org8589272">3. Quick start</a></li>
<li><a href="#orgdd7af70">4. Specifications</a>
<ul>
<li><a href="#org97effc8">4.1. Command-line options</a></li>
<li><a href="#org934e24c">4.2. Output</a></li>
<li><a href="#org26034c1">4.3. Return codes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd460417" class="outline-2">
<h2 id="orgd460417"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
The 'bestwhois' command-line utility make queries through the API
service provided by WhoisXML API, Inc. It is intended as a replacement
of the standard 'whois' command for domain and IP WHOIS queries, to
provide accurate queries from our WHOIS database via the WHOIS API
(<a href="https://whoisapi.whoisxmlapi.com">https://whoisapi.whoisxmlapi.com</a>). In addition it can yield historic
WHOIS records for domains by invoking the WHOIS history API
(<a href="https://whois-history-api.whoisxmlapi.com">https://whois-history-api.whoisxmlapi.com</a>).
</p>

<p>
By default it gives a pretty-printed human-readable JSON output, which
is at least as readable and definitely more structured as the standard
textual output of WHOIS. Optionally it can also print a textual output
which is closer to usual WHOIS.
</p>

<p>
The use of the utility requires a subscription to the Whois API, see
its details at <a href="https://whoisapi.whoisxmlapi.com">https://whoisxmlapi.com</a>. A free subscription
is also available.
</p>
</div>
</div>

<div id="outline-container-orgab23b20" class="outline-2">
<h2 id="orgab23b20"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3fdf284" class="outline-3">
<h3 id="org3fdf284"><span class="section-number-3">2.1</span> Prerequisites</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>The program is written in series 3 Python, so it has to be installed</li>
</ul>
<p>
on your system to run. It has been tested with version &gt;= 3.6.
</p>
<ul class="org-ul">
<li>It depends also on the pygments, argparse, and requests
packages. You may install these with the package manager of your OS
(e.g. apt), or using Python's package manager, 'pip', by doing</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">pip3 install pygments argparse requests
</pre>
</div>
<p>
in your shell or Windows command line. If you want to query for
domains with national characters with Unicode encoding, you also need
the <code>idna</code> package:
</p>
<div class="org-src-container">
<pre class="src src-bash">pip3 install idna
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb32a639" class="outline-3">
<h3 id="orgb32a639"><span class="section-number-3">2.2</span> Running the program</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Windows users</b> have to rename the file "bestwhois" to "bestwhois.py"
</p>
<div class="org-src-container">
<pre class="src src-bash">move bestwhois bestwhois.py
</pre>
</div>
<p>
and use it as bestwhois.py. When first running, it has to associated
with Python in this environment.
</p>

<p>
Apart from this, all you need is a valid API key which can be obtained
after registration.  You may specify this for the program in various
ways:
</p>
<ul class="org-ul">
<li>With the &#x2013;api-key= command-line option</li>
<li>Writing the API key single-line into a text file (named rc file in
what follows), and specifying the location with the &#x2013;rcfile= option</li>
<li>Naming the rc file  ".bestwhoisrc", and putting it
to your home directory or next to the script. We recommend to
withdraw read permissions from other files on this.</li>
<li>Putting the rc file to /etc/bestwhoisrc .</li>
</ul>

<p>
The program currently uses the same API key for both the WHOIS API and
the WHOIS History API. If your key is not valid for either of these,
an error will produced.
</p>
</div>
</div>
</div>

<div id="outline-container-org8589272" class="outline-2">
<h2 id="org8589272"><span class="section-number-2">3</span> Quick start</h2>
<div class="outline-text-2" id="text-3">
<p>
Having a proper rc file, the program should simply run from
command-line. You may want to put it to some location in the path,
e.g. to /usr/local/bin on UNIX-flavor systems. Just try
</p>
<div class="org-src-container">
<pre class="src src-bash">bestwhois domainwhoisdatabase.com
</pre>
</div>
<p>
(Or 
</p>
<div class="org-src-container">
<pre class="src src-bash">bestwhois.py domainwhoisdatabase.com
</pre>
</div>
<p>
on Windows).
</p>

<p>
A help is available with the &#x2013;help option.
</p>

<p>
Some further examples:
</p>
<ul class="org-ul">
<li>A simple WHOIS query with text output:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois --text domainwhoisdatabase.com
</pre>
</div>
<ul class="org-ul">
<li>Simple WHOIS query with raw text fields fully included:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois --fullrawtext domainwhoisdatabase.com
</pre>
</div>
<ul class="org-ul">
<li>IP WHOIS query with non-colored output:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois --nocolor 104.27.154.235
</pre>
</div>
<ul class="org-ul">
<li>Full history query:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois --history domainwhoisdatabase.com
</pre>
</div>
<ul class="org-ul">
<li>History query with date restrictions:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois domainwhoisdatabase.com --created-date-from 2000-01-01 --expired-date-to 2020-01-01
</pre>
</div>
<ul class="org-ul">
<li>Query a domain with national characters (the two lines are equivalent):</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">bestwhois &#1084;&#1086;&#1089;&#1082;&#1074;&#1072;.&#1088;&#1092; 
bestwhois xn--80adxhks.xn--p1ai
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd7af70" class="outline-2">
<h2 id="orgdd7af70"><span class="section-number-2">4</span> Specifications</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org97effc8" class="outline-3">
<h3 id="org97effc8"><span class="section-number-3">4.1</span> Command-line options</h3>
<div class="outline-text-3" id="text-4-1">
<p>
A full list of command-line options can be obtained by invoking the
program with the &#x2013;help option. 
</p>

<p>
Note: the options marked with "(history)" in their description imply
the use of the WHOIS History API instead of the WHOIS API.
</p>
</div>
</div>
<div id="outline-container-org934e24c" class="outline-3">
<h3 id="org934e24c"><span class="section-number-3">4.2</span> Output</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The output consists of parsed WHOIS records as specified by the
command-line options. The default is a colorized JSON-like text. On
Windows consoles, coloring is not supported.
</p>

<p>
If there are no WHOIS records in the output of the API, the output of
the API is printed.
</p>
</div>
</div>
<div id="outline-container-org26034c1" class="outline-3">
<h3 id="org26034c1"><span class="section-number-3">4.3</span> Return codes</h3>
<div class="outline-text-3" id="text-4-3">
<dl class="org-dl">
<dt><code>0</code></dt><dd>Normal termination.</dd>
<dt><code>1</code></dt><dd>Error in the API call. Typical reasons: bad API key, nonexistent domain name in the History API.</dd>
<dt><code>2</code></dt><dd>No WHOIS records in the reply.</dd>
<dt><code>3</code></dt><dd>Tried to query a domain with Unicode national characters and the <code>idna</code> package is not installed.</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: v 0.1.0, 2022.02.08.</p>
<p class="author">Author: WhoisXML API, Inc.</p>
<p class="date">Created: 2022-02-09 Wed 02:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
